interactions:
- request:
    body: null
    headers:
      Accept:
      - application/json
      Accept-Encoding:
      - gzip, deflate
      CommandName:
      - monitor log-analytics workspace create
      Connection:
      - keep-alive
      ParameterSetName:
      - -n -g
      User-Agent:
      - AZURECLI/2.37.0 azsdk-python-azure-mgmt-resource/21.1.0b1 Python/3.8.10 (Windows-10-10.0.19044-SP0)
    method: GET
    uri: https://management.azure.com/subscriptions/00000000-0000-0000-0000-000000000000/resourcegroups/cli_test_sentinel_000001?api-version=2021-04-01
  response:
    body:
      string: '{"id":"/subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/cli_test_sentinel_000001","name":"cli_test_sentinel_000001","type":"Microsoft.Resources/resourceGroups","location":"eastus2","tags":{"product":"azurecli","cause":"automation","date":"2022-06-24T09:40:47Z"},"properties":{"provisioningState":"Succeeded"}}'
    headers:
      cache-control:
      - no-cache
      content-length:
      - '327'
      content-type:
      - application/json; charset=utf-8
      date:
      - Fri, 24 Jun 2022 09:40:50 GMT
      expires:
      - '-1'
      pragma:
      - no-cache
      strict-transport-security:
      - max-age=31536000; includeSubDomains
      vary:
      - Accept-Encoding
      x-content-type-options:
      - nosniff
    status:
      code: 200
      message: OK
- request:
    body: '{"location": "eastus2", "properties": {"sku": {"name": "PerGB2018"}, "retentionInDays":
      30, "workspaceCapping": {}}}'
    headers:
      Accept:
      - application/json
      Accept-Encoding:
      - gzip, deflate
      CommandName:
      - monitor log-analytics workspace create
      Connection:
      - keep-alive
      Content-Length:
      - '116'
      Content-Type:
      - application/json
      ParameterSetName:
      - -n -g
      User-Agent:
      - AZURECLI/2.37.0 azsdk-python-mgmt-loganalytics/13.0.0b4 Python/3.8.10 (Windows-10-10.0.19044-SP0)
    method: PUT
    uri: https://management.azure.com/subscriptions/00000000-0000-0000-0000-000000000000/resourcegroups/cli_test_sentinel_000001/providers/Microsoft.OperationalInsights/workspaces/workspace-000002?api-version=2021-12-01-preview
  response:
    body:
      string: "{\r\n  \"properties\": {\r\n    \"source\": \"Azure\",\r\n    \"customerId\":
        \"c5f51b0c-dc71-4e09-8806-20977bdd2255\",\r\n    \"provisioningState\": \"Creating\",\r\n
        \   \"sku\": {\r\n      \"name\": \"pergb2018\",\r\n      \"lastSkuUpdate\":
        \"Fri, 24 Jun 2022 09:40:56 GMT\"\r\n    },\r\n    \"retentionInDays\": 30,\r\n
        \   \"features\": {\r\n      \"legacy\": 0,\r\n      \"searchVersion\": 1,\r\n
        \     \"enableLogAccessUsingOnlyResourcePermissions\": true\r\n    },\r\n
        \   \"workspaceCapping\": {\r\n      \"dailyQuotaGb\": -1.0,\r\n      \"quotaNextResetTime\":
        \"Fri, 24 Jun 2022 13:00:00 GMT\",\r\n      \"dataIngestionStatus\": \"RespectQuota\"\r\n
        \   },\r\n    \"publicNetworkAccessForIngestion\": \"Enabled\",\r\n    \"publicNetworkAccessForQuery\":
        \"Enabled\",\r\n    \"createdDate\": \"Fri, 24 Jun 2022 09:40:56 GMT\",\r\n
        \   \"modifiedDate\": \"Fri, 24 Jun 2022 09:40:56 GMT\"\r\n  },\r\n  \"id\":
        \"/subscriptions/00000000-0000-0000-0000-000000000000/resourcegroups/cli_test_sentinel_000001/providers/microsoft.operationalinsights/workspaces/workspace-000002\",\r\n
        \ \"name\": \"workspace-000002\",\r\n  \"type\": \"Microsoft.OperationalInsights/workspaces\",\r\n
        \ \"location\": \"eastus2\"\r\n}"
    headers:
      access-control-allow-origin:
      - '*'
      cache-control:
      - no-cache
      content-length:
      - '1075'
      content-type:
      - application/json
      date:
      - Fri, 24 Jun 2022 09:40:57 GMT
      pragma:
      - no-cache
      request-context:
      - appId=cid-v1:e6336c63-aab2-45f0-996a-e5dbab2a1508
      server:
      - Microsoft-IIS/10.0
      strict-transport-security:
      - max-age=31536000; includeSubDomains
      x-content-type-options:
      - nosniff
      x-ms-ratelimit-remaining-subscription-writes:
      - '1199'
      x-powered-by:
      - ASP.NET
      - ASP.NET
    status:
      code: 201
      message: Created
- request:
    body: null
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      CommandName:
      - monitor log-analytics workspace create
      Connection:
      - keep-alive
      ParameterSetName:
      - -n -g
      User-Agent:
      - AZURECLI/2.37.0 azsdk-python-mgmt-loganalytics/13.0.0b4 Python/3.8.10 (Windows-10-10.0.19044-SP0)
    method: GET
    uri: https://management.azure.com/subscriptions/00000000-0000-0000-0000-000000000000/resourcegroups/cli_test_sentinel_000001/providers/Microsoft.OperationalInsights/workspaces/workspace-000002?api-version=2021-12-01-preview
  response:
    body:
      string: "{\r\n  \"properties\": {\r\n    \"source\": \"Azure\",\r\n    \"customerId\":
        \"c5f51b0c-dc71-4e09-8806-20977bdd2255\",\r\n    \"provisioningState\": \"Succeeded\",\r\n
        \   \"sku\": {\r\n      \"name\": \"pergb2018\",\r\n      \"lastSkuUpdate\":
        \"Fri, 24 Jun 2022 09:40:56 GMT\"\r\n    },\r\n    \"retentionInDays\": 30,\r\n
        \   \"features\": {\r\n      \"legacy\": 0,\r\n      \"searchVersion\": 1,\r\n
        \     \"enableLogAccessUsingOnlyResourcePermissions\": true\r\n    },\r\n
        \   \"workspaceCapping\": {\r\n      \"dailyQuotaGb\": -1.0,\r\n      \"quotaNextResetTime\":
        \"Fri, 24 Jun 2022 13:00:00 GMT\",\r\n      \"dataIngestionStatus\": \"RespectQuota\"\r\n
        \   },\r\n    \"publicNetworkAccessForIngestion\": \"Enabled\",\r\n    \"publicNetworkAccessForQuery\":
        \"Enabled\",\r\n    \"createdDate\": \"Fri, 24 Jun 2022 09:40:56 GMT\",\r\n
        \   \"modifiedDate\": \"Fri, 24 Jun 2022 09:40:57 GMT\"\r\n  },\r\n  \"id\":
        \"/subscriptions/00000000-0000-0000-0000-000000000000/resourcegroups/cli_test_sentinel_000001/providers/microsoft.operationalinsights/workspaces/workspace-000002\",\r\n
        \ \"name\": \"workspace-000002\",\r\n  \"type\": \"Microsoft.OperationalInsights/workspaces\",\r\n
        \ \"location\": \"eastus2\"\r\n}"
    headers:
      access-control-allow-origin:
      - '*'
      cache-control:
      - no-cache
      content-length:
      - '1076'
      content-type:
      - application/json
      date:
      - Fri, 24 Jun 2022 09:41:27 GMT
      pragma:
      - no-cache
      request-context:
      - appId=cid-v1:e6336c63-aab2-45f0-996a-e5dbab2a1508
      server:
      - Microsoft-IIS/10.0
      strict-transport-security:
      - max-age=31536000; includeSubDomains
      transfer-encoding:
      - chunked
      vary:
      - Accept-Encoding,Accept-Encoding
      x-content-type-options:
      - nosniff
      x-powered-by:
      - ASP.NET
      - ASP.NET
    status:
      code: 200
      message: OK
- request:
    body: null
    headers:
      Accept:
      - application/json
      Accept-Encoding:
      - gzip, deflate
      CommandName:
      - monitor log-analytics solution create
      Connection:
      - keep-alive
      ParameterSetName:
      - -t -w -g
      User-Agent:
      - AZURECLI/2.37.0 azsdk-python-mgmt-loganalytics/13.0.0b4 Python/3.8.10 (Windows-10-10.0.19044-SP0)
    method: GET
    uri: https://management.azure.com/subscriptions/00000000-0000-0000-0000-000000000000/resourcegroups/cli_test_sentinel_000001/providers/Microsoft.OperationalInsights/workspaces/workspace-000002?api-version=2021-12-01-preview
  response:
    body:
      string: "{\r\n  \"properties\": {\r\n    \"source\": \"Azure\",\r\n    \"customerId\":
        \"c5f51b0c-dc71-4e09-8806-20977bdd2255\",\r\n    \"provisioningState\": \"Succeeded\",\r\n
        \   \"sku\": {\r\n      \"name\": \"pergb2018\",\r\n      \"lastSkuUpdate\":
        \"Fri, 24 Jun 2022 09:40:56 GMT\"\r\n    },\r\n    \"retentionInDays\": 30,\r\n
        \   \"features\": {\r\n      \"legacy\": 0,\r\n      \"searchVersion\": 1,\r\n
        \     \"enableLogAccessUsingOnlyResourcePermissions\": true\r\n    },\r\n
        \   \"workspaceCapping\": {\r\n      \"dailyQuotaGb\": -1.0,\r\n      \"quotaNextResetTime\":
        \"Fri, 24 Jun 2022 13:00:00 GMT\",\r\n      \"dataIngestionStatus\": \"RespectQuota\"\r\n
        \   },\r\n    \"publicNetworkAccessForIngestion\": \"Enabled\",\r\n    \"publicNetworkAccessForQuery\":
        \"Enabled\",\r\n    \"createdDate\": \"Fri, 24 Jun 2022 09:40:56 GMT\",\r\n
        \   \"modifiedDate\": \"Fri, 24 Jun 2022 09:40:57 GMT\"\r\n  },\r\n  \"id\":
        \"/subscriptions/00000000-0000-0000-0000-000000000000/resourcegroups/cli_test_sentinel_000001/providers/microsoft.operationalinsights/workspaces/workspace-000002\",\r\n
        \ \"name\": \"workspace-000002\",\r\n  \"type\": \"Microsoft.OperationalInsights/workspaces\",\r\n
        \ \"location\": \"eastus2\"\r\n}"
    headers:
      access-control-allow-origin:
      - '*'
      cache-control:
      - no-cache
      content-length:
      - '1076'
      content-type:
      - application/json
      date:
      - Fri, 24 Jun 2022 09:41:28 GMT
      pragma:
      - no-cache
      request-context:
      - appId=cid-v1:e6336c63-aab2-45f0-996a-e5dbab2a1508
      server:
      - Microsoft-IIS/10.0
      strict-transport-security:
      - max-age=31536000; includeSubDomains
      transfer-encoding:
      - chunked
      vary:
      - Accept-Encoding,Accept-Encoding
      x-content-type-options:
      - nosniff
      x-powered-by:
      - ASP.NET
      - ASP.NET
    status:
      code: 200
      message: OK
- request:
    body: '{"location": "eastus2", "plan": {"name": "SecurityInsights(workspace-000002)",
      "publisher": "Microsoft", "promotionCode": "", "product": "OMSGallery/SecurityInsights"},
      "properties": {"workspaceResourceId": "/subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/cli_test_sentinel_000001/providers/microsoft.OperationalInsights/workspaces/workspace-000002"}}'
    headers:
      Accept:
      - application/json
      Accept-Encoding:
      - gzip, deflate
      CommandName:
      - monitor log-analytics solution create
      Connection:
      - keep-alive
      Content-Length:
      - '370'
      Content-Type:
      - application/json; charset=utf-8
      ParameterSetName:
      - -t -w -g
      User-Agent:
      - python/3.8.10 (Windows-10-10.0.19044-SP0) msrest/0.7.0 msrest_azure/0.6.4
        azure-mgmt-operationsmanagement/0.1.0 Azure-SDK-For-Python AZURECLI/2.37.0
      accept-language:
      - en-US
    method: PUT
    uri: https://management.azure.com/subscriptions/00000000-0000-0000-0000-000000000000/resourcegroups/cli_test_sentinel_000001/providers/Microsoft.OperationsManagement/solutions/SecurityInsights%28workspace-000002%29?api-version=2015-11-01-preview
  response:
    body:
      string: "{\r\n  \"plan\": {\r\n    \"name\": \"SecurityInsights(workspace-000002)\",\r\n
        \   \"publisher\": \"Microsoft\",\r\n    \"promotionCode\": \"\",\r\n    \"product\":
        \"OMSGallery/SecurityInsights\"\r\n  },\r\n  \"properties\": {\r\n    \"workspaceResourceId\":
        \"/subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/cli_test_sentinel_000001/providers/microsoft.OperationalInsights/workspaces/workspace-000002\",\r\n
        \   \"provisioningState\": \"Succeeded\",\r\n    \"creationTime\": \"Mon,
        01 Jan 0001 00:00:00 GMT\",\r\n    \"sku\": {\r\n      \"name\": \"PerGB\"\r\n
        \   },\r\n    \"lastModifiedTime\": \"Mon, 01 Jan 0001 00:00:00 GMT\",\r\n
        \   \"containedResources\": []\r\n  },\r\n  \"id\": \"/subscriptions/00000000-0000-0000-0000-000000000000/resourcegroups/cli_test_sentinel_000001/providers/Microsoft.OperationsManagement/solutions/SecurityInsights(workspace-000002)\",\r\n
        \ \"name\": \"SecurityInsights(workspace-000002)\",\r\n  \"type\": \"Microsoft.OperationsManagement/solutions\",\r\n
        \ \"location\": \"East US 2\"\r\n}"
    headers:
      access-control-allow-origin:
      - '*'
      cache-control:
      - no-cache
      cachecontrol:
      - no-cache
      content-length:
      - '940'
      content-type:
      - application/json; charset=utf-8
      date:
      - Fri, 24 Jun 2022 09:41:39 GMT
      expires:
      - '-1'
      pragma:
      - no-cache
      request-context:
      - appId=cid-v1:e6336c63-aab2-45f0-996a-e5dbab2a1508
      server:
      - Microsoft-IIS/10.0
      strict-transport-security:
      - max-age=31536000; includeSubDomains
      x-ams-apiversion:
      - WebAPI1.0
      x-content-type-options:
      - nosniff
      x-ms-ratelimit-remaining-subscription-writes:
      - '1199'
      x-powered-by:
      - ASP.NET
      - ASP.NET
    status:
      code: 201
      message: Created
- request:
    body: '{"properties": {"displayName": "My bookmark", "entityMappings": [{"entityType":
      "Account", "fieldMappings": [{"identifier": "Fullname", "value": "johndoe@microsoft.com"}]}],
      "labels": ["Tag1", "Tag2"], "notes": "Found a suspicious activity", "query":
      "SecurityEvent | where TimeGenerated > ago(1d) and TimeGenerated < ago(2d)",
      "queryResult": "Security Event query result", "tactics": ["Execution"], "techniques":
      ["T1609"]}}'
    headers:
      Accept:
      - application/json
      Accept-Encoding:
      - gzip, deflate
      CommandName:
      - sentinel bookmark create
      Connection:
      - keep-alive
      Content-Length:
      - '425'
      Content-Type:
      - application/json
      ParameterSetName:
      - -n -w -g --query-content --query-result --display-name --notes --entity-mappings
        --tactics --techniques --labels
      User-Agent:
      - AZURECLI/2.37.0 (AAZ) azsdk-python-core/1.24.0 Python/3.8.10 (Windows-10-10.0.19044-SP0)
    method: PUT
    uri: https://management.azure.com/subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/cli_test_sentinel_000001/providers/Microsoft.OperationalInsights/workspaces/workspace-000002/providers/Microsoft.SecurityInsights/bookmarks/2216d0e1-91e3-4902-89fd-d2df8c535096?api-version=2022-06-01-preview
  response:
    body:
      string: '{"id":"/subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/cli_test_sentinel_000001/providers/Microsoft.OperationalInsights/workspaces/workspace-000002/providers/Microsoft.SecurityInsights/Bookmarks/2216d0e1-91e3-4902-89fd-d2df8c535096","name":"2216d0e1-91e3-4902-89fd-d2df8c535096","etag":"\"c2000a5b-0000-0100-0000-62b586d70000\"","type":"Microsoft.SecurityInsights/Bookmarks","properties":{"displayName":"My
        bookmark","created":"2022-06-24T09:41:43.0827769+00:00","updated":"2022-06-24T09:41:43+00:00","createdBy":{"objectId":"f44cc02c-cec4-4b32-860a-50bdf6ab7362","email":"ethanyang@microsoft.com","name":"Ethan
        Yang"},"updatedBy":{"objectId":"f44cc02c-cec4-4b32-860a-50bdf6ab7362","email":"ethanyang@microsoft.com","name":"Ethan
        Yang"},"eventTime":"2022-06-24T09:41:43.0825764+00:00","notes":"Found a suspicious
        activity","labels":["Tag1","Tag2"],"query":"SecurityEvent | where TimeGenerated
        > ago(1d) and TimeGenerated < ago(2d)","queryResult":"Security Event query
        result","incidentInfo":{"incidentId":null,"title":null,"relationName":null,"severity":null},"entityMappings":[{"entityType":"Account","fieldMappings":[{"identifier":"Fullname","value":"johndoe@microsoft.com"}]}],"tactics":["Execution"],"techniques":["T1609"]}}'
    headers:
      cache-control:
      - no-cache
      content-length:
      - '1247'
      content-type:
      - application/json; charset=utf-8
      date:
      - Fri, 24 Jun 2022 09:41:42 GMT
      expires:
      - '-1'
      pragma:
      - no-cache
      server:
      - Kestrel
      strict-transport-security:
      - max-age=31536000; includeSubDomains
      transfer-encoding:
      - chunked
      vary:
      - Accept-Encoding
      x-content-type-options:
      - nosniff
      x-ms-ratelimit-remaining-subscription-writes:
      - '1198'
    status:
      code: 200
      message: OK
- request:
    body: '{"properties": {"classification": "FalsePositive", "classificationComment":
      "Not a malicious activity", "classificationReason": "IncorrectAlertLogic", "description":
      "This is a demo incident", "firstActivityTimeUtc": "2019-01-01T13:00:30Z", "lastActivityTimeUtc":
      "2019-01-01T13:05:30Z", "owner": {"objectId": "2046feea-040d-4a46-9e2b-91c2941bfa70"},
      "severity": "High", "status": "Closed", "title": "My incident"}}'
    headers:
      Accept:
      - application/json
      Accept-Encoding:
      - gzip, deflate
      CommandName:
      - sentinel incident create
      Connection:
      - keep-alive
      Content-Length:
      - '415'
      Content-Type:
      - application/json
      ParameterSetName:
      - -n -w -g --classification --classification-reason --classification-comment
        --first-activity-time-utc --last-activity-time-utc --severity --status --title
        --description --owner
      User-Agent:
      - AZURECLI/2.37.0 (AAZ) azsdk-python-core/1.24.0 Python/3.8.10 (Windows-10-10.0.19044-SP0)
    method: PUT
    uri: https://management.azure.com/subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/cli_test_sentinel_000001/providers/Microsoft.OperationalInsights/workspaces/workspace-000002/providers/Microsoft.SecurityInsights/incidents/afbd324f-6c48-459c-8710-8d1e1cd03812?api-version=2022-06-01-preview
  response:
    body:
      string: '{"id":"/subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/cli_test_sentinel_000001/providers/Microsoft.OperationalInsights/workspaces/workspace-000002/providers/Microsoft.SecurityInsights/Incidents/afbd324f-6c48-459c-8710-8d1e1cd03812","name":"afbd324f-6c48-459c-8710-8d1e1cd03812","etag":"\"06009247-0000-0100-0000-62b586d80000\"","type":"Microsoft.SecurityInsights/Incidents","properties":{"title":"My
        incident","description":"This is a demo incident","severity":"High","status":"Closed","classification":"FalsePositive","classificationReason":"IncorrectAlertLogic","classificationComment":"Not
        a malicious activity","owner":{"objectId":"2046feea-040d-4a46-9e2b-91c2941bfa70","email":null,"assignedTo":null,"userPrincipalName":null,"ownerType":"Unknown"},"labels":[],"firstActivityTimeUtc":"2019-01-01T13:00:30Z","lastActivityTimeUtc":"2019-01-01T13:05:30Z","lastModifiedTimeUtc":"2022-06-24T09:41:44.7097092Z","createdTimeUtc":"2022-06-24T09:41:44.7097092Z","incidentNumber":1,"additionalData":{"alertsCount":0,"bookmarksCount":0,"commentsCount":0,"alertProductNames":[],"tactics":[],"techniques":[]},"relatedAnalyticRuleIds":[],"incidentUrl":"https://portal.azure.com/#asset/Microsoft_Azure_Security_Insights/Incident/subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/cli_test_sentinel_000001/providers/Microsoft.OperationalInsights/workspaces/workspace-000002/providers/Microsoft.SecurityInsights/Incidents/afbd324f-6c48-459c-8710-8d1e1cd03812","providerName":"Azure
        Sentinel","providerIncidentId":"1"}}'
    headers:
      cache-control:
      - no-cache
      content-length:
      - '1540'
      content-type:
      - application/json; charset=utf-8
      date:
      - Fri, 24 Jun 2022 09:41:44 GMT
      expires:
      - '-1'
      pragma:
      - no-cache
      server:
      - Kestrel
      strict-transport-security:
      - max-age=31536000; includeSubDomains
      x-content-type-options:
      - nosniff
      x-ms-ratelimit-remaining-subscription-resource-requests:
      - '499'
    status:
      code: 201
      message: Created
- request:
    body: '{"properties": {"relatedResourceId": "/subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/cli_test_sentinel_000001/providers/Microsoft.OperationalInsights/workspaces/workspace-000002/providers/Microsoft.SecurityInsights/Incidents/afbd324f-6c48-459c-8710-8d1e1cd03812"}}'
    headers:
      Accept:
      - application/json
      Accept-Encoding:
      - gzip, deflate
      CommandName:
      - sentinel bookmark relation create
      Connection:
      - keep-alive
      Content-Length:
      - '284'
      Content-Type:
      - application/json
      ParameterSetName:
      - -n -w -g --bookmark-id --related-resource-id
      User-Agent:
      - AZURECLI/2.37.0 (AAZ) azsdk-python-core/1.24.0 Python/3.8.10 (Windows-10-10.0.19044-SP0)
    method: PUT
    uri: https://management.azure.com/subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/cli_test_sentinel_000001/providers/Microsoft.OperationalInsights/workspaces/workspace-000002/providers/Microsoft.SecurityInsights/bookmarks/2216d0e1-91e3-4902-89fd-d2df8c535096/relations/relation-000003?api-version=2022-06-01-preview
  response:
    body:
      string: '{"id":"/subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/cli_test_sentinel_000001/providers/Microsoft.OperationalInsights/workspaces/workspace-000002/providers/Microsoft.SecurityInsights/Bookmarks/2216d0e1-91e3-4902-89fd-d2df8c535096/relations/relation-000003","name":"relation-000003","etag":"\"c200255b-0000-0100-0000-62b586d90000\"","type":"Microsoft.SecurityInsights/Bookmarks/relations","properties":{"relatedResourceId":"/subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/cli_test_sentinel_000001/providers/Microsoft.OperationalInsights/workspaces/workspace-000002/providers/Microsoft.SecurityInsights/Incidents/afbd324f-6c48-459c-8710-8d1e1cd03812","relatedResourceName":"afbd324f-6c48-459c-8710-8d1e1cd03812","relatedResourceType":"Microsoft.SecurityInsights/Incidents"}}'
    headers:
      cache-control:
      - no-cache
      content-length:
      - '812'
      content-type:
      - application/json; charset=utf-8
      date:
      - Fri, 24 Jun 2022 09:41:45 GMT
      expires:
      - '-1'
      pragma:
      - no-cache
      server:
      - Kestrel
      strict-transport-security:
      - max-age=31536000; includeSubDomains
      transfer-encoding:
      - chunked
      vary:
      - Accept-Encoding
      x-content-type-options:
      - nosniff
      x-ms-ratelimit-remaining-subscription-writes:
      - '1199'
    status:
      code: 200
      message: OK
- request:
    body: null
    headers:
      Accept:
      - application/json
      Accept-Encoding:
      - gzip, deflate
      CommandName:
      - sentinel bookmark relation list
      Connection:
      - keep-alive
      ParameterSetName:
      - -w -g --bookmark-id
      User-Agent:
      - AZURECLI/2.37.0 (AAZ) azsdk-python-core/1.24.0 Python/3.8.10 (Windows-10-10.0.19044-SP0)
    method: GET
    uri: https://management.azure.com/subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/cli_test_sentinel_000001/providers/Microsoft.OperationalInsights/workspaces/workspace-000002/providers/Microsoft.SecurityInsights/bookmarks/2216d0e1-91e3-4902-89fd-d2df8c535096/relations?api-version=2022-06-01-preview
  response:
    body:
      string: '{"value":[{"id":"/subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/cli_test_sentinel_000001/providers/Microsoft.OperationalInsights/workspaces/workspace-000002/providers/Microsoft.SecurityInsights/Bookmarks/2216d0e1-91e3-4902-89fd-d2df8c535096/relations/relation-000003","name":"relation-000003","etag":"\"c200255b-0000-0100-0000-62b586d90000\"","type":"Microsoft.SecurityInsights/Bookmarks/relations","properties":{"relatedResourceId":"/subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/cli_test_sentinel_000001/providers/Microsoft.OperationalInsights/workspaces/workspace-000002/providers/Microsoft.SecurityInsights/Incidents/afbd324f-6c48-459c-8710-8d1e1cd03812","relatedResourceName":"afbd324f-6c48-459c-8710-8d1e1cd03812","relatedResourceType":"Microsoft.SecurityInsights/Incidents"}}]}'
    headers:
      cache-control:
      - no-cache
      content-length:
      - '824'
      content-type:
      - application/json; charset=utf-8
      date:
      - Fri, 24 Jun 2022 09:41:46 GMT
      expires:
      - '-1'
      pragma:
      - no-cache
      server:
      - Kestrel
      strict-transport-security:
      - max-age=31536000; includeSubDomains
      transfer-encoding:
      - chunked
      vary:
      - Accept-Encoding
      x-content-type-options:
      - nosniff
    status:
      code: 200
      message: OK
- request:
    body: null
    headers:
      Accept:
      - application/json
      Accept-Encoding:
      - gzip, deflate
      CommandName:
      - sentinel bookmark relation show
      Connection:
      - keep-alive
      ParameterSetName:
      - -n -w -g --bookmark-id
      User-Agent:
      - AZURECLI/2.37.0 (AAZ) azsdk-python-core/1.24.0 Python/3.8.10 (Windows-10-10.0.19044-SP0)
    method: GET
    uri: https://management.azure.com/subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/cli_test_sentinel_000001/providers/Microsoft.OperationalInsights/workspaces/workspace-000002/providers/Microsoft.SecurityInsights/bookmarks/2216d0e1-91e3-4902-89fd-d2df8c535096/relations/relation-000003?api-version=2022-06-01-preview
  response:
    body:
      string: '{"id":"/subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/cli_test_sentinel_000001/providers/Microsoft.OperationalInsights/workspaces/workspace-000002/providers/Microsoft.SecurityInsights/Bookmarks/2216d0e1-91e3-4902-89fd-d2df8c535096/relations/relation-000003","name":"relation-000003","etag":"\"c200255b-0000-0100-0000-62b586d90000\"","type":"Microsoft.SecurityInsights/Bookmarks/relations","properties":{"relatedResourceId":"/subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/cli_test_sentinel_000001/providers/Microsoft.OperationalInsights/workspaces/workspace-000002/providers/Microsoft.SecurityInsights/Incidents/afbd324f-6c48-459c-8710-8d1e1cd03812","relatedResourceName":"afbd324f-6c48-459c-8710-8d1e1cd03812","relatedResourceType":"Microsoft.SecurityInsights/Incidents"}}'
    headers:
      cache-control:
      - no-cache
      content-length:
      - '812'
      content-type:
      - application/json; charset=utf-8
      date:
      - Fri, 24 Jun 2022 09:41:47 GMT
      expires:
      - '-1'
      pragma:
      - no-cache
      server:
      - Kestrel
      strict-transport-security:
      - max-age=31536000; includeSubDomains
      transfer-encoding:
      - chunked
      vary:
      - Accept-Encoding
      x-content-type-options:
      - nosniff
    status:
      code: 200
      message: OK
- request:
    body: null
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      CommandName:
      - sentinel bookmark relation delete
      Connection:
      - keep-alive
      Content-Length:
      - '0'
      ParameterSetName:
      - -n -w -g --bookmark-id --yes
      User-Agent:
      - AZURECLI/2.37.0 (AAZ) azsdk-python-core/1.24.0 Python/3.8.10 (Windows-10-10.0.19044-SP0)
    method: DELETE
    uri: https://management.azure.com/subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/cli_test_sentinel_000001/providers/Microsoft.OperationalInsights/workspaces/workspace-000002/providers/Microsoft.SecurityInsights/bookmarks/2216d0e1-91e3-4902-89fd-d2df8c535096/relations/relation-000003?api-version=2022-06-01-preview
  response:
    body:
      string: '{}'
    headers:
      cache-control:
      - no-cache
      content-length:
      - '2'
      content-type:
      - application/json; charset=utf-8
      date:
      - Fri, 24 Jun 2022 09:41:48 GMT
      expires:
      - '-1'
      pragma:
      - no-cache
      server:
      - Kestrel
      strict-transport-security:
      - max-age=31536000; includeSubDomains
      transfer-encoding:
      - chunked
      vary:
      - Accept-Encoding
      x-content-type-options:
      - nosniff
      x-ms-ratelimit-remaining-subscription-deletes:
      - '14999'
    status:
      code: 200
      message: OK
version: 1
